app/Controllers/Personas.php

SELECT *
FROM "personas"
---
    public function index()
    {
        $model = new PersonasModel();
        $data = $model->findAll();

SELECT *
FROM "personas"
WHERE "persona_id" = '1'
---
    public function show($id = null)
    {
        $model = new PersonasModel();
        $data = $model->getWhere(['persona_id' => $id])->getResult();

INSERT INTO "personas" ("nombre", "apellido", "edad") VALUES (NULL, NULL, NULL)
---
    public function create()
    {
        $model = new PersonasModel();
        $data = [
            'nombre' => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'edad' => $this->request->getPost('edad')
        ];
        $model->insert($data);

SELECT *
FROM "personas"
WHERE "personas"."persona_id" = '2'
DELETE FROM "personas"
WHERE "persona_id" IN ('2')
---
    public function delete($id = null)
    {
        $model = new PersonasModel();
        $data = $model->find($id);
        if($data){
            $model->delete($id);