app/Controllers/Productos.php

SELECT *
FROM "productos"
---
    public function index()
    {
        $model = new ProductosModel();
        $data = $model->findAll();

SELECT *
FROM "productos"
WHERE "producto_id" = '2'
---
    public function show($id = null)
    {
        $model = new ProductosModel();
        $data = $model->getWhere(['producto_id' => $id])->getResult();

INSERT INTO "productos" ("nombre_producto", "sabor_producto", "precio_producto") VALUES ('Caramelo', 'Dulce', '0.15')
---
    public function create()
    {
        $model = new ProductosModel();

        $data = [
            'nombre_producto' => $this->request->getPost('nombre_producto'),
            'sabor_producto' => $this->request->getPost('sabor_producto'),
            'precio_producto' => $this->request->getPost('precio_producto')
        ];
        $model->insert($data);

SELECT *
FROM "productos"
WHERE "productos"."producto_id" = '1'
DELETE FROM "productos"
WHERE "producto_id" IN ('1')
---
    public function delete($id = null)
    {
        $model = new ProductosModel();
        $data = $model->find($id);
        if($data){
            $model->delete($id);